Repository: 84000/data-translation-memory
Catalog: toh216-v3.tmx
Source language: bo
Languages: en

source: འཇམ་དཔལ་སྤྲུལ་པ་ནི་སོང་བ་ཡང་མེད། འོང་བ་ཡང་མེད་དོ།
en: Mañjuśrī, emanations are free from both coming and going.” “

source: །སྨྲས་པ། རིགས་ཀྱི་བུ་ཇི་ལྟར་སྤྲུལ་པ་སོང་བ་ཡང་མེད། འོང་བ་ཡང་མེད་པ་དེ་བཞིན་དུ་ཆོས་ཐམས་ཅད་ཀྱང་དེའི་འགྲོས་ཅན་ཉིད་དོ།
en: Noble son, just as the emanation is free from coming and going, so is the mode of all phenomena.

source: །སེམས་ཅན་ཐམས་ཅད་ཀྱང་དེའི་འགྲོས་ཅན་ཉིད་དོ། །སྨྲས་པ།
en: All beings have that mode as well.” “

source: འཇམ་དཔལ་ཆོས་ཐམས་ཅད་ཇི་ལྟ་བུའི་འགྲོས་ཅན་ལགས། སྨྲས་པ།
en: Mañjuśrī, what is the mode of all phenomena?” “

source: རང་བཞིན་གནས་པའི་འགྲོས་ཅན་ནོ། །སྨྲས་པ།
en: It is the natural mode.” “

source: ཡང་སེམས་ཅན་ཐམས་ཅད་ཇི་ལྟ་བུའི་འགྲོས་ཅན་ལགས། སྨྲས་པ།
en: Also, what is the mode of all beings?” “

source: ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ཇི་ལྟ་བུའི་འགྲོས་ཅན་པ་དེ་བཞིན་ནོ། །སྨྲས་པ།
en: Their mode accords with the ripening of action.” “

source: འཇམ་དཔལ་འོ་ན་ཆོས་ཐམས་ཅད་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་མ་མཆིས་པ་མ་ལགས་སམ། སྨྲས་པ།
en: Well then, Mañjuśrī, are not all phenomena devoid of the ripening of action?” “

source: རིགས་ཀྱི་བུ་ཆོས་ཉིད་ལ་ནི་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་མེད་དོ།
en: Noble son, there is no ripening of action in reality.

source: ཆོས་ཐམས་ཅད་ནི་ཆོས་ཉིད་ཀྱི་རྗེས་སུ་འཇུག་པའི་ཕྱིར་རོ། །སྨྲས་པ།
en: Because all phenomena accord with reality.” “

source: འོ་ན་ཇི་ལྟར་ན་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ཇི་ལྟ་བུའི་འགྲོས་ཅན་པ་དེ་བཞིན་པ་ལགས། སྨྲས་པ།
en: Well then, how does the ripening of action have that mode?” “

source: ལས་དེ་ཇི་ལྟ་བ་རྣམ་པར་སྨིན་པ་ཡང་དེ་བཞིན།
en: Just as the action, so is the ripening.

source: དེའི་འགྲོ་བ་ཡང་དེ་བཞིན་ནོ། །སྨྲས་པ།
en: Its existence is likewise.” “

source: འཇམ་དཔལ་ལས་ཇི་ལྟ་བུ་ལགས།
en: Mañjuśrī, what is action like?

source: རྣམ་པར་སྨིན་པ་ཇི་ལྟ་བུ་ལགས།
en: What is ripening like?

source: འགྲོ་བ་ཇི་ལྟ་བུ་ལགས། སྨྲས་པ།
en: What is existence like?” “

source: དེ་བཞིན་ཉིད་ཇི་ལྟ་བར་ལས་ཀྱང་དེ་བཞིན།
en: Action is just like suchness.

source: རྣམ་པར་སྨིན་པ་ཡང་དེ་བཞིན།
en: So is ripening.

source: འགྲོ་བ་ཡང་དེ་བཞིན་ནོ།
en: So is existence.” “

source: །སྨྲས་པ། འཇམ་དཔལ་དེ་བཞིན་ཉིད་ལ་ནི་ལས་ཀྱང་མ་མཆིས། རྣམ་པར་སྨིན་པ་ཡང་མ་མཆིས། འགྲོ་བ་ཡང་མ་མཆིས་སོ། །སྨྲས་པ།
en: Mañjuśrī, in suchness there is no action, no ripening, and no existence.” “

source: རིགས་ཀྱི་བུ་ཇི་ལྟར་དེ་བཞིན་ཉིད་ལ་ལས་ཀྱང་མེད། རྣམ་པར་སྨིན་པ་ཡང་མེད། འགྲོ་བ་ཡང་མེད་པ་ལྟར་ལས་ཀྱི་རྣམ་པར་སྨིན་པའི་འགྲོ་བ་ཡང་དེ་བཞིན་དུ་ཤེས་པར་བྱའོ།
en: Noble son, just as in suchness there is no action, no ripening, and no existence, so you must understand the existence of the ripening of action.

source: །ལས་ཀྱི་རྣམ་པར་སྨིན་པའི་འགྲོ་བ་ནི་འོང་བ་མེད་པ་ཅན་འགྲོ་བ་མེད་པ་ཅན་ཡིན་ཏེ། དེ་ནི་དེ་བཞིན་ཉིད་ཀྱི་འགྲོས་ལས་འདའ་བར་མི་འགྱུར་རོ།
en: The existence of the ripening of action has no coming and no going—it does not transcend the mode of suchness.”

source: །བསྟན་པ་འདི་བསྟན་པའི་ཚེ་སངས་རྒྱས་ཀྱི་མཐུས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་དང་། ཚེ་དང་ལྡན་པ་དགའ་བོ་དང་། ཉན་ཐོས་ཆེན་པོ་གཞན་དག་ཀྱང་། བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པའི་སྤྱན་སྔ་ན་བསྟན་པ་འདི་ལ་ཉན་ཏོ།། །།བམ་པོ་གཉིས་པ།
en: When this teaching was given, through the power of the Buddha, venerable Śāriputra, venerable Nanda, and the other great hearers heard this teaching in the presence of the blessed Śākyamuni.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཆོས་ཉིད་ནི་གཅིག་པ་ཁོ་ན་ལགས་ན། སྐྱེས་བུ་དམ་པ་སྐྱེས་བུ་ཆེན་པོ་དེ་དག་བརྗོད་པ་སྣ་ཚོགས་ཀྱིས་སྟོན་ཀྱང་ཆོས་ཉིད་དང་ཡང་མི་འགལ་བར་བགྱིད་པ་ངོ་མཚར་ཏོ།
en: Venerable Śāriputra then said to the Blessed One, “Blessed One, if reality is indeed wholly singular, it is remarkable that these great and sublime beings can make diverse statements without contradicting reality.

source: །བཅོམ་ལྡན་འདས་སུ་ཞིག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་མི་སྐྱེ་བར་འགྱུར།
en: Blessed One, who could not develop the mind directed toward unsurpassed and perfect awakening?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་དག་ནི་དེ་ལྟར་མ་ཆགས་པའི་སློབ་པ་ལ་སློབ་ཅིང་མི་ཆགས་བཞིན་དུ་སྟོན་ཏེ།
en: The Blessed One responded, “Śāriputra, in this way, bodhisattvas train in unobstructed trainings and teach in an unobstructed manner.

source: ཤཱ་རིའི་བུ་ས་བོན་ཇི་ལྟ་བ་བཞིན་སྐྱེད་ཀྱང་དེ་བཞིན་ནོ། །ཤཱ་རིའི་བུ་དེ་དང་འདྲ་བར་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བསླབ་པ་ཇི་ལྟ་བ་དེ་བཞིན་དུ་དེ་དག་གི་ཡེ་ཤེས་སོ།
en: Śāriputra, just as the fruit accords with the seed, so the bodhisattvas’ wisdom accords with their training.

source: །དེ་བཞིན་དུ་དེ་དག་གི་སྟོན་པའོ།
en: This is also the case with their teachings.

source: །ཤཱ་རིའི་བུ་ཁྱོད་ཀྱིས་བསླབ་པ་ཇི་ལྟ་བུ་ལ་བསླབས་པ་ཁྱོད་ཀྱི་ཡེ་ཤེས་ཀྱང་དེ་བཞིན་ནོ།
en: Śāriputra, your wisdom will also accord with your training.

source: །སྤོབས་པ་ཡང་དེ་དང་འདྲ་བར་ཁྱོད་ཀྱིས་ཐོབ་བོ།
en: The eloquence you gain will also accord with this.”

source: །བྱང་ཆུབ་སེམས་དཔའ་འོད་བཀོད་པས་གསོལ་པ། བཅོམ་ལྡན་འདས་ཉན་ཐོས་ཀྱི་བསླབ་པ་ཇི་ལྟ་བུ་ལགས།
en: The bodhisattva Prabhāvyūha asked, “Blessed One, can you please describe the training of the hearers?

source: བྱང་ཆུབ་སེམས་དཔའི་བསླབ་པ་ཇི་ལྟ་བུ་ལགས།
en: Can you please describe the training of the bodhisattvas?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་ཉན་ཐོས་ཀྱི་བསླབ་པ་ནི་ཚད་ཡོད་པ། བྱང་ཆུབ་སེམས་དཔའི་བསླབ་པ་ནི་ཚད་མེད་པ་སྟེ།
en: The Blessed One answered, “Noble son, the training of the hearers is limited, whereas the training of the bodhisattvas is limitless.

source: རིགས་ཀྱི་བུ་ཇི་ལྟར་ཉན་ཐོས་ཀྱི་བསླབ་པ་ཚད་ཡོད་ལ་ཆགས་པ་དང་བཅས་པ་དེ་བཞིན་དུ་དེའི་ཡེ་ཤེས་ཀྱང་ཚད་ཡོད་ལ་ཆགས་པ་དང་བཅས་པའོ།
en: Noble son, to the degree to which one is engaged in the limited and restricted training of the hearers, so will one’s wisdom be limited and restricted.

source: །རིགས་ཀྱི་བུ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་བསླབ་པ་ཚད་མེད་ལ་ཆགས་པ་མེད་པ་དེ་བཞིན་དུ་དེའི་ཡེ་ཤེས་ཀྱང་ཚད་མེད་ལ་ཆགས་པ་མེད་པའོ།
en: Noble son, to the degree to which one is engaged in the limitless and unobstructed trainings of the bodhisattvas, so will one’s wisdom be limitless and unobstructed.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འོད་བཀོད་པས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་འཁོར་འདི་ནས་སུ་ཡང་ཆོས་ཉན་པ་མི་སྤོང་བར་བགྱི་ན། སྐྱེས་བུ་དམ་པ་དེ་དག་འདིར་མཆི་བར་མཚན་མ་ཞིག་མཛད་དུ་གསོལ།
en: The bodhisattva great being Prabhāvyūha then asked the Blessed One, “Blessed One, no one in this assembly will give up listening to the Dharma, so please give those sublime beings a sign to come here.

source: དེ་ཅིའི་སླད་དུ་ཞེ་ན།
en: Why do I ask this?

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ནི་ཟབ་མོ་ལ་མོས་པས་དེའི་ཆོས་བཤད་པ་ཡང་ཟབ་མོ་ལགས་སོ།
en: Since Mañjuśrī Kumārabhūta is devoted to the profound, the Dharma he teaches is also profound.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་འོང་བར་བྱ་བའི་ཕྱིར་མཚན་མ་མཛད་དོ།
en: The Blessed One then gave the sign for Mañjuśrī Kumārabhūta to come.

source: །དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་སྐྱེས་བུ་དམ་པ་ཉི་ཤུ་རྩ་ལྔ་པོ་དེ་དག་དང་འགྲོགས། ལྷའི་འཁོར་དེ་དག་དང་འགྲོགས་ཏེ།
en: Mañjuśrī Kumārabhūta arrived before the Blessed One accompanied by the twenty-five sublime beings and the assembly of gods.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་ནས་ཕྱིན་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ།
en: They bowed their heads at the feet of the Blessed One and stood to one side.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འོད་བཀོད་པས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཇམ་དཔལ་ཁྱོད་ཅིའི་ཕྱིར་དེ་བཞིན་གཤེགས་པའི་འཁོར་ནས་བྱུང་ལ་ཕྱོགས་གཅིག་ཏུ་སོང་སྟེ་ཆོས་སྟོན།
en: The bodhisattva great being Prabhāvyūha then asked Mañjuśrī Kumārabhūta, “Mañjuśrī, why have you left the Blessed One’s assembly to teach the Dharma in another place?” “

source: སྨྲས་པ། རིགས་ཀྱི་བུ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དག་ནི་མཉེས་པར་དཀའ་སྟེ།
en: Noble son, the blessed buddhas are difficult to please.

source: གཏམ་ཐམས་ཅད་ཀྱིས་མཉེས་པར་མི་ནུས་སོ།
en: Not all talk pleases them.” “

source: །སྨྲས་པ། འཇམ་དཔལ་གཏམ་ཇི་ལྟ་བུས་དེ་བཞིན་གཤེགས་པ་མཉེས་པར་འགྱུར། སྨྲས་པ།
en: Mañjuśrī, what kind of talk pleases the Thus-Gone One?” “

source: བཅོམ་ལྡན་འདས་ཉིད་མཁྱེན་ཏེ་ཐུགས་སུ་ཆུད་མོད་ཀྱི། བདག་ཇི་ལྟར་སྤོབས་པ་དེ་བཞིན་དུ་སྟོན་ཏོ།
en: Though of course the Blessed One knows this in his wisdom, I shall explain it according to my degree of eloquence.

source: །རིགས་ཀྱི་བུ་གཏམ་གང་ཆོས་ཀྱི་དབྱིངས་དང་ཡང་མི་འགལ། དེ་བཞིན་ཉིད་དང་ཡང་མི་འགལ། ཡང་དག་པའི་མཐའ་དང་ཡང་མི་འགལ་བ་དེ་འདྲ་བའི་གཏམ་གྱིས་དེ་བཞིན་གཤེགས་པ་མཉེས་པར་འགྱུར་རོ། །གཏམ་གང་འཐབ་པ་མེད་པ།
en: Noble son, the Thus-Gone One is pleased by a talk that does not contradict the realm of phenomena, that does not contradict reality, and that does not contradict the limit of reality.

source: རྩོད་པ་མེད་པ། རྩོམ་པ་མེད་པ། ཀླན་ཀ་མེད་པ། སྒྲོ་འདོགས་པ་མེད་པ། དེ་འདྲ་བའི་གཏམ་གྱིས་དེ་བཞིན་གཤེགས་པ་མཉེས་པར་འགྱུར་རོ། །གཏམ་གང་བདག་ལ་སྒྲོ་མི་འདོགས།
en: The Thus-Gone One is pleased by a talk that is free of strife, free of debate, free of composition, free of dispute, free of imputation, and the like.

source: གཞན་ལ་སྒྲོ་མི་འདོགས། ཆོས་ལ་སྒྲོ་མི་འདོགས། ཆོས་མ་ཡིན་པ་ལ་སྒྲོ་མི་འདོགས། འཁོར་བ་ལ་སྒྲོ་མི་འདོགས། མྱ་ངན་ལས་འདའ་བ་ལ་སྒྲོ་མི་འདོགས་པ་དེ་འདྲ་བའི་གཏམ་གྱིས་དེ་བཞིན་གཤེགས་པ་མཉེས་པར་འགྱུར་རོ།
en: The Thus-Gone One is pleased by a talk that does not make imputations in terms of a self, imputations in terms of others, imputations in terms of phenomena, imputations in terms of nonphenomena, imputations in terms of saṃsāra, imputations in terms of nirvāṇa, and the like.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ནས་ལེགས་སོ་ལེགས་སོ།
en: Then the Blessed One expressed his approval to Mañjuśrī Kumārabhūta, “Excellent, excellent!

source: །འཇམ་དཔལ་ཁྱོད་ཀྱི་ཚིག་འདི་ལེགས་པར་བཤད་པ་ཡིན་ཏེ།
en: Mañjuśrī, you have spoken well.

source: འདི་འདྲ་བའི་གཏམ་གྱིས་དེ་བཞིན་གཤེགས་པ་མཉེས་པར་འགྱུར་མོད་ཀྱི།
en: Such a talk does indeed please the Thus-Gone One.

source: འཇམ་དཔལ་གཏམ་གང་སྤྲོས་པ་ཐམས་ཅད་ལས་འདས་པ། ཧ་ཅང་ཡང་མི་ཞིབ་པ། ཧ་ཅང་ཡང་མི་རྩིང་བ། མཚན་མ་མེད་པའི་གཏམ་དེ་བརྗོད་ན་ཏིང་ངེ་འཛིན་ཀྱང་མི་གཏོང་། རྟག་ཏུ་ཤིན་ཏུ་སེམས་མཉམ་པར་ཡང་གཞོག་ཅིང་སྟོན་པར་བྱེད་ལ་ཆོས་གང་ཡང་འཕེལ་བའམ།
en: However, Mañjuśrī, the Thus-Gone One is pleased by a talk that transcends all elaboration, that is neither too fine nor too coarse, and that is free of marks—a talk that does not take one out of absorption but instead teaches how to continuously place the mind in equipoise and that does not cause one to perceive any phenomena as increasing or decreasing.”

source: འབྲི་བར་ཡང་མི་མཐོང་བ་དེ་འདྲ་བའི་གཏམ་གྱིས་དེ་བཞིན་གཤེགས་པ་མཉེས་པར་འགྱུར་རོ། །སྟོན་པ་འདི་བསྟན་པའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་བརྒྱད་སྟོང་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་རབ་ཏུ་ཐོབ་པར་གྱུར་ཏོ།
en: When this teaching was given, eight thousand bodhisattvas gained the acceptance that phenomena are nonarising.

source: །འཁོར་དེ་ནས་ལྷའི་བུ་སྔོན་སྤྱོད་པ་དང་ལྡན་པས་བྱང་ཆུབ་ཀྱི་སེམས་རབ་ཏུ་སྟོར་བ་ཉིས་བརྒྱ་འདི་སྙམ་དུ་གྱུར་ཏེ། སངས་རྒྱས་ཀྱི་ཆོས་ཀྱང་དེ་ལྟར་ཚད་མེད་པ་བྱང་ཆུབ་སེམས་དཔའི་བསླབ་པ་ཡང་དེ་ལྟར་ཤིན་ཏུ་བསླབ་དཀའ་བ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱང་དེ་ཙམ་དུ་བསྒྲུབ་དཀའ་བ་ཡིན་ན་བདག་ཅག་གིས་སློབ་པ་འདི་བསླབ་མི་ནུས་ཀྱིས།
en: However, two hundred gods in the assembly who had given up the mind of awakening because of past conduct thought, “If the qualities of buddhahood are that limitless, if the trainings of the bodhisattvas are that difficult to undertake, and if unsurpassed and perfect awakening is that difficult to attain, then we cannot undertake this training.

source: གང་བདག་ཅག་ནི་ཉན་ཐོས་ཀྱི་ཐེག་པའམ། རང་སངས་རྒྱས་ཀྱི་ཐེག་པས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་བྱའོ་སྙམ་མོ།
en: We should therefore reach nirvāṇa via the vehicles of the hearers and solitary buddhas.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ལྷའི་བུ་དེ་དག་གི་སེམས་ཀྱི་རྟོག་པ་ཐུགས་ཀྱིས་མཁྱེན་ནས།
en: Knowing their thoughts, the Blessed One thought, “Oh, these gods have the fortune to fully awaken to unsurpassed and perfect awakening.”

source: ཀྱེ་མའོ་ལྷའི་བུ་འདི་དག་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་འཚང་རྒྱ་བའི་སྐལ་བ་ཡོད་དོ་ཞེས་ལྷའི་བུ་དེ་དག་གདུལ་བའི་དབང་གི་ཕྱིར་འཁོར་གྱི་ཕྱི་རོལ་དུ་ཁྱིམ་བདག་གཅིག་མངོན་པར་སྤྲུལ་ནས་ཁྱིམ་བདག་དེས་ལྷུང་བཟེད་ཁ་ཟས་རོ་བརྒྱས་གང་བ་ཞིག་ལག་པ་གཡས་པ་ན་ཐོགས་པར་གྱུར་ཏོ།
en: In order to guide them, he emanated a householder outside the retinue bearing in his right hand an alms bowl full of delicious food.

source: །དེ་ནས་ཁྱིམ་བདག་དེ་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ལྷུང་བཟེད་ཁ་ཟས་ཀྱིས་བཀང་བ་དེ་བཅོམ་ལྡན་འདས་ལ་ཕུལ་ནས། བཅོམ་ལྡན་འདས་བདག་ལ་ཐུགས་བརྩེ་བའི་སླད་དུ་ཞལ་ཟས་འདི་བཞེས་པར་གསོལ་ཞེས་དེ་སྐད་གསོལ་པ་དང་།
en: The householder approached the Blessed One, bowed his head at the Blessed One’s feet, offered the alms bowl full of food to the Blessed One, and said, “Blessed One, out of your care for me, please accept this food.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ལྷུང་བཟེད་ཟས་ཀྱིས་བཀང་བ་དེ་བཞེས་སོ།
en: The Blessed One then accepted the alms bowl filled with food.

source: །དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་སྟན་ལས་ལངས་ཏེ། བླ་གོས་ཕྲག་པ་གཅིག་ལ་གཟར་ནས་ཐལ་མོ་སྦྱར་ཏེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཞལ་ཟས་འདི་ལས་བདག་ལ་མ་སྩལ་བར་གསོལ་ན་ནི་བཅོམ་ལྡན་འདས་བྱས་པ་གཟོ་བ་མི་མཛད་པར་འགྱུར་རོ།
en: Mañjuśrī Kumārabhūta now rose from his seat, draped his shawl over one shoulder, and with palms joined said to the Blessed One, “Blessed One, if you were to eat this food without sharing it with me, Blessed One, you would not be showing gratitude.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་འདི་སྙམ་དུ་གྱུར་ཏེ། ཀྱེ་མའོ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་སྔོན་བཅོམ་ལྡན་འདས་ལ་ཇི་ལྟ་བུ་ཞིག་ཏུ་ཕན་བཏགས་ན་དེའི་ཕྱིར་ད་བྱས་པ་གཟོ་བ་མེད་པས་རྒོལ་སྙམ་མོ།
en: At that moment, venerable Śāriputra thought, “Oh, how did Mañjuśrī Kumārabhūta benefit the Blessed One in the past such that now he criticizes the Blessed One for not being grateful?”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུའི་སེམས་ཀྱི་རྟོག་པ་མཁྱེན་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་དུས་མཁྱེན་ཏེ། ཁྱོད་ལ་བཀའ་སྩོལ་གྱིས་སྡོད་ཅིག །
en: Knowing venerable Śāriputra’s thoughts, the Blessed One said to him, “Śāriputra, the Thus-Gone One knows that it is time to instruct you, so stay seated.”

source: དེས་བཅོམ་ལྡན་འདས་ཀྱིས་ལྷུང་བཟེད་དེ་ས་ཆེན་པོའི་ནང་དུ་བཏང་བ་དང་།
en: The Blessed One then dropped the alms bowl into the earth.

source: བཏང་མ་ཐག་ཏུ་འོག་གི་ཕྱོགས་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་གང་དང་གང་དག་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་བཞུགས་ཤིང་འཚོ་གཞེས་པའི་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་དག་གི་སྤྱན་སྔར་ལྷུང་བཟེད་དེ་སོང་ངོ་།
en: As soon as he released the alms bowl, it appeared before all the perfect buddhas living in the buddha realms in which blessed buddhas reside in the direction below.

source: །དེ་ནས་ལྷུང་བཟེད་དེ་འོག་གི་ཕྱོགས་ཀྱི་ཆ་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་འདས་ནས་འཇིག་རྟེན་གྱི་ཁམས་སྣང་བ་དང་ལྡན་པ་ཞེས་བྱ་བ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་ཟེར་གྱི་རྒྱལ་པོ་ཞེས་བྱ་བ་བཞུགས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་ལྷུང་བཟེད་དེ་མ་བཟུང་བར་བར་སྣང་ལ་འདུག་པར་གྱུར་ཏོ།
en: The alms bowl passed through buddha realms as numerous as the grains of sand in the Ganges until it reached the world called Luminous—the buddha realm of thus-gone, worthy, perfect Buddha Raśmirāja. There, it hovered in midair without anyone holding it.

source: །སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ལ་ཡང་བདག་བདག་གི་བསྙེན་བཀུར་བྱེད་པ་དག་གིས་བཅོམ་ལྡན་འདས་ལྷུང་བཟེད་འདི་ག་ལས་མཆིས་ཞེས་ཞུས་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་ཀྱང་སྟེང་གི་ཕྱོགས་ཀྱི་ཆ་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་ཅེས་བྱ་བ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པའི་དྲུང་ནས་འོངས་ཏེ།
en: The servants of each of these blessed buddhas asked them, “Blessed One, where has this alms bowl come from?” The blessed buddhas explained, “It came from above, from the Sahā world.

source: བྱང་ཆུབ་སེམས་དཔའ་གཞན་དག་གདུལ་བའི་ཕྱིར་བཏང་བ་ཡིན་ནོ་ཞེས་བསྟན་ཏོ།
en: The blessed, thus-gone, worthy, perfect Buddha Śākyamuni has sent it in order to guide other bodhisattvas.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ལ་བཀའ་སྩལ་པ། ཤཱ་རིའི་བུ་ལྷུང་བཟེད་དེ་ཕྱུང་ཤིག །གང་ན་འདུག་པ་ག་ལ་ན་འདུག་པ་དེའང་ཚོལ་ཅིག །
en: The Blessed One then told venerable Śāriputra, “Śāriputra, follow the alms bowl—find out where it is, where it lies.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ཏིང་ངེ་འཛིན་སྟོང་ཕྲག་བཅུ་ལ་ཞུགས་ནས། བདག་གི་ཤེས་རབ་ཀྱི་སྟོབས་དང་། སངས་རྒྱས་ཀྱི་མཐུས་སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་ཕྲག་བཅུར་སོང་ཡང་ལྷུང་བཟེད་དེའི་གནས་སམ་གཞི་ཡང་མ་མཐོང་ནས་དེ་སླར་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་གོ།
en: Venerable Śāriputra now entered ten thousand states of absorption, and through the strength of his insight and the power of the Buddha, he visited ten thousand buddha realms without seeing the place or location of the alms bowl.

source: །འདུག་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: He subsequently returned to the Blessed One.

source: །བཅོམ་ལྡན་འདས་བདག་གིས་ལྷུང་བཟེད་དེའི་གནས་སམ་གཞི་ཡང་མ་མཐོང་ངོ་།
en: Seated there, he reported to the Blessed One, “Blessed One, I have not seen the place or location of the alms bowl.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་མཽང་གལ་གྱི་བུ་ཆེན་པོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །མཽང་གལ་གྱི་བུ་ཁྱོད་ཀྱིས་ལྷུང་བཟེད་དེ་ཚོལ་ཅིག །
en: The Blessed One then told venerable Maudgalyāyana, “Maudgalyāyana, please search for the alms bowl.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་མཽང་གལ་གྱི་བུ་ཆེན་པོས་ཏིང་ངེ་འཛིན་སྟོང་ཕྲག་བཅུ་ལ་ཞུགས་ནས་སངས་རྒྱས་ཀྱི་མཐུ་དང་། བདག་གི་རྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱིས་འོག་གི་ཕྱོགས་ཀྱི་ཆ་སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་ཕྲག་བཅུར་སོང་ཡང་ལྷུང་བཟེད་དེའི་གནས་སམ་གཞིའང་མ་མཐོང་ནས་དེ་སླར་ཡང་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་གོ།
en: Venerable Maudgalyāyana then entered ten thousand states of absorption, and through the power of the Buddha and the strength of his own miraculous power, he visited ten thousand buddha realms below without seeing the place or location of the alms bowl.

source: །བཅོམ་ལྡན་འདས་བདག་གིས་ལྷུང་བཟེད་དེའི་གནས་སམ་གཞིའང་མ་མཐོང་ངོ་།
en: Seated there, he reported to the Blessed One, “Blessed One, I have not seen the place or location of the alms bowl.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་བཀའ་སྩལ་པ། རབ་འབྱོར་ཁྱོད་ཀྱིས་ལྷུང་བཟེད་དེ་ཚོལ་ཅིག །
en: The Blessed One then told venerable Subhūti, “Subhūti, please search for the alms bowl.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་ཏིང་ངེ་འཛིན་སྟོང་ཕྲག་བཅུ་གཉིས་ལ་ཞུགས་ནས་སངས་རྒྱས་ཀྱི་མཐུ་དང་། བདག་གི་རྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱིས་འོག་གི་ཕྱོགས་ཀྱི་ཆ་སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་ཕྲག་བཅུ་གཉིས་སུ་སོང་ཡང་ལྷུང་བཟེད་དེ་མ་མཐོང་ནས་དེ་སླར་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་གོ།
en: Venerable Subhūti then entered twelve thousand states of absorption, and through the power of the Buddha and the strength of his own miraculous power, he visited twelve thousand buddha realms below without seeing the alms bowl.

source: །དེ་བཞིན་ཉིད་དུ་ཉན་ཐོས་ཆེན་པོ་ལྔ་བརྒྱ་ཙམ་བདག་བདག་གི་རྫུ་འཕྲུལ་གྱི་སྟོབས་དང་། ལྷའི་མིག་གིས་ལྷུང་བཟེད་དེ་བཙལ་ཀྱང་མ་རྙེད་དོ།
en: Continuing in this way, five hundred great hearers sought the alms bowl through the strength of their own miraculous power and the divine eye, but they could not find it.

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བྱམས་པ་ཁྱོད་ནི་བཅོམ་ལྡན་འདས་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སྐྱེ་བ་གཅིག་གིས་ཐོགས་པར་ལུང་བསྟན་ན། ལྷུང་བཟེད་དེ་གང་ན་འདུག་གལ་ན་འདུག་ཚོལ་ཅིག་ཅེས་དེ་སྐད་སྨྲས་པ་དང་།
en: Venerable Subhūti then said to the bodhisattva Maitreya, “Maitreya, since you have been prophesied by the Blessed One to be only one life away from awakening to unsurpassed and perfect buddhahood, please search for the location and the site of the alms bowl.”

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བཙུན་པ་རབ་འབྱོར་བདག་ནི་དེ་བཞིན་གཤེགས་པས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སྐྱེ་བ་གཅིག་གིས་ཐོགས་པར་ལུང་བསྟན་མོད་ཀྱི། བདག་གིས་ནི་ཏིང་ངེ་འཛིན་དེ་དག་གི་མིང་ཡང་མ་འཚལ་ཏེ།
en: The bodhisattva great being Maitreya responded to venerable Subhūti, “Respected Subhūti, while indeed I have been prophesied by the Thus-Gone One to be within one life of awakening to unsurpassed and perfect awakening, I do not so much as know the names of those states of absorption.

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ནི་ཏིང་ངེ་འཛིན་དེ་དག་ལ་མཉམ་པར་ཡང་གཞོག །
en: Mañjuśrī Kumārabhūta on the other hand has actually entered and exited those states of absorption.

source: ལྡང་བར་ཡང་བགྱིད་དོ། །ཡང་བཙུན་པ་རབ་འབྱོར་བདག་གིས་བྱང་ཆུབ་ཐོབ་པ་ན་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་དང་འདྲ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དག་དེ་བཞིན་གཤེགས་པ་ཇི་ལྟར་གོམ་པ་འདོར། ཇི་ལྟར་འཇོག་པར་མཛད་ཅེས་གོམ་པ་གཅིག་འདོར་ཞིང་འཇོག་པ་ཡང་མི་ཤེས་པའི་དུས་དང་ཚེ་ཡང་མཆིས་པར་འགྱུར་རོ།
en: Furthermore, respected Subhūti, when I gain awakening, there will come a time and occasion when, being unable to comprehend even how the Thus-Gone One takes a single step, such bodhisattva great beings will ask Mañjuśrī Kumārabhūta, ‘How does the Thus-Gone One lift up his foot and place it down?’

source: །དེ་བས་ན་བཙུན་པ་རབ་འབྱོར་འཇམ་དཔལ་ཉིད་ལ་གསོལ་ཅིག་དང་།
en: Therefore, respected Subhūti, ask this of Mañjuśrī himself.

source: དེས་ནི་ལྷུང་བཟེད་དེ་ཚོར་བ་དང་འབྱིན་པར་ནུས་སོ།
en: He will be able to find and extract that alms bowl.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་གནས་བརྟན་རབ་འབྱོར་གྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ཅི་ནས་ཀྱང་ལྷུང་བཟེད་དེ་ཕྱུང་སྟེ། བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་དབུལ་བར་བསྒོར་གསོལ།
en: The elder Subhūti then asked the Blessed One, “Blessed One, can you please instruct Mañjuśrī Kumārabhūta to extract the alms bowl by any means and offer it before the Blessed One?”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་བཀའ་སྩལ་པ། འཇམ་དཔལ་ལྷུང་བཟེད་དེ་ཕྱུང་ཤིག །
en: The Blessed One said to Mañjuśrī Kumārabhūta, “Mañjuśrī, please extract the alms bowl.

source: ལྷུང་བཟེད་དེ་གང་ན་འདུག་པ་དང་། ག་ལ་ན་འདུག་པ་ཡང་ཤེས་པར་གྱིས་ཤིག །
en: Please declare where the alms bowl is and where it lies.”

source: དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་འདི་སྙམ་དུ་གྱུར་ཏེ། གང་བདག་ནི་སྟན་ལས་ཀྱང་མི་ལྡང་ཞིང་འཁོར་འདི་ནས་མི་སྣང་བར་ཡང་མ་གྱུར་པར་ལྷུང་བཟེད་དེ་དབྱུང་ངོ་སྙམ་མོ།
en: Then Mañjuśrī Kumārabhūta thought, “I must extract the alms bowl without rising from my seat or disappearing from this assembly.”

source: །དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ཀུན་གྱི་རྗེས་སུ་སོང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་མཉམ་པར་བཞག་སྟེ། འོག་གི་ས་ཆེན་པོ་ལ་ལག་པ་གཡས་པ་བརྐྱང་ངོ་།
en: So he settled into the absorption called in agreement with all and extended his right hand toward the earth below him.

source: །དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པའི་ལག་པ་དེ་སངས་རྒྱས་ཀྱི་ཞིང་གང་དང་གང་དག་ན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་མངོན་དུ་གྱུར་པ་དེ་དང་དེ་དག་ཏུ་ལག་པ་དེ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ལ་ཕྱག་འཚལ་ཞིང་སོང་ནས།
en: Using his hand, Mañjuśrī Kumārabhūta then went on to pay homage to those buddhas who were present in all the buddha realms below.

source: ལག་པ་དེ་ལས་བཅོམ་ལྡན་འདས་ལ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་སྙུང་བ་མ་མཆིས་སམ། འོ་མ་བརྒྱལ་ཏམ། བཞེངས་པ་ཡང་ངམ། སོ་བཞིན་ནམ། མཐུ་མངའ་འམ། བདེ་བ་ལ་རེག་པར་གནས་སམ་ཞེས་གསུང་ངོ་ཞེས་ཟེར་བའི་སྒྲ་ཕྱུང་ངོ་།
en: From his hand a sound emerged, asking those blessed ones, “The blessed, thus-gone, worthy, perfect Buddha Śākyamuni is inquiring whether you are free from illness, whether you are tired, whether you are healthy, whether you are comfortable, whether you are strong, and whether you are well.”

source: །དེ་ནས་ལག་པའི་སྤུའི་ཁུང་བུ་ཐམས་ཅད་ནས་འོད་ཟེར་བྱེ་བ་བརྒྱ་སྟོང་བྱུང་སྟེ།
en: Then, from every pore on his hand billions of light rays sprang forth.

source: འོད་ཟེར་ཐམས་ཅད་ལས་མེ་ཏོག་པད་མ་བརྒྱ་སྟོང་བྱུང་ཞིང་པད་མ་དེ་ཐམས་ཅད་ཀྱི་སྙིང་པོ་དག་ལ་དེ་བཞིན་གཤེགས་པའི་སྐུ་དག་བཞུགས་པར་སྣང་ངོ་། །དེ་བཞིན་གཤེགས་པའི་སྐུ་དེ་དག་ཐམས་ཅད་ཀྱང་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པའི་བསྔགས་པ་བརྗོད་དོ།
en: From each ray of light emerged thousands of lotus flowers, and in the heart of each lotus flower appeared the form of a thus-gone one seated, each singing the praises of the blessed thus-gone Śākyamuni.

source: །ལག་པ་དེ་སངས་རྒྱས་ཀྱི་ཞིང་གང་དང་གང་དུ་འགྲོ་བའི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་ཐམས་ཅད་ཀྱང་རྣམ་པ་དྲུག་ཏུ་རབ་ཏུ་གཡོས་སོ།
en: The hand shook in six ways each buddha realm to which it went.

source: །སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་ཐམས་ཅད་སྣང་བ་ཆེན་པོས་ཀྱང་ཁྱབ་པར་གྱུར་ཏོ།
en: Each of the buddha realms was bathed in a bright light.

source: །སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་ཐམས་ཅད་གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་གྱིས་ཀྱང་བརྒྱན་པར་གྱུར་ཏོ།
en: Each realm was adorned with parasols, flags, and banners.
